// //循环打印1-10之间所有的整数
// //初始值
// var i=1;
// do{ 
//     console.log(i)
//     //循环体
//    i++;
//    //增量
// }while(i<=10);//循环条件

//练习：打印10-1之间所有的整数
//练习：使用循环打印50 60 65 70
// var i1=10;
// do{
//     console.log(i1);
//     i1--
// }while(i1>=1);


// var i2=50;
// do{
//     console.log(i2);
//     i2+=5;
// }while(i2<=70);

//练习：打印出1-100之间能被三整除的数字
// var i3=1;
// do{
//     //i代表1-100之间的所有整数
//     if(i3%3===0){
//         console.log(i3);
//     }
//     i3++;
// }while(i3<=100);

//练习：计算1--100之间所有能被7整除的数字的和
// var i=1;
// var sum=0;
// do{
    
//     if(i%7===0){
//       sum+=i  ;
//         //console.log(i);
//     }
//     i++;
// }while(i<=100);
// console.log(sum);


//练习：循环弹出提示框，声明变量保存用户输入的值，如果输入正确强制结束循环，
//警示框弹出‘login success’;如果输入的次数超过三次，强制结束循环，提示警示框‘game over’.
// var uname=prompt('root');
// var uid=prompt('123456');


var i=0;           // 开始
do{
    // 保存用户输入的值
    var str=prompt('媳妇是个傻妞（回答是或不是）');
    //每弹出一次就记录一次
    i++;
    if(str==='是'){

     alert('恭喜你答对咯！');
     break;
    }  
   //如果三次后包括第三次强制结束
   if(i>=3){
       alert('继续回答');
       break;
   }
}while(true);          //  结束


//练习：死循环弹出提示框，使用变量保存用户输入的值，在循环条件的位置判断是否正确
// do{
//     //保存用户输入的值
//     var str=prompt('input password');

// }while(str!=='123456');
// '123456'!=='123456'如果输入正确，得到false,结束循环
// '888888'!=='123456'如果输入错误，得到true,继续循环


