// 红球：在1-33之间随机取6个，不能重复，按照从小到大的排序
// 篮球：在1-16之间随机取1个，可以和之前的红球数字重复
// 把这组数字放入一个新数组中

//红球
var red=[];
for(i=1;i<=33;i++){
    red.push(i);
};
// var red=['1','2','3','4','5','6','7','8','9','10','11','12',
// '13','14','15','16','17','18','19','20','21','22','23','24',
// '25','26','27','28','29','30','31','32','33'];

// 准备一个空数组，用于存放获取到的随机
var arr=[];
//循环六次，随机取六个
for(i=0;i<6;i++){
    //获取随机下标
 var  n=Math.floor(Math.random()*red.length);
    //通过随机下标（n） 找到对应元素
    //把获取的随机元素添加准备好的数据arr
    arr.push(red[n]);
    //把这个元素从原数组（red）中删除
    red.splice(n,1);
};
//将获取的这组数字进行从小到大的排序
arr.sort(function(a,b){
    return a-b;
})


//篮球  在1-16之间随机取一个
//随机产生一个1-16之间的整数
var  blue=Math.floor(Math.random()*16)+1
//把取到的数组放入到准备好的数组最后
arr.push(blue);

console.log(arr);
// console.log(red)

